burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_tsi.c
            /* config TSI_CTL1 */
            ctl1 = TSI_CTL1;
            ctl1 &= ~TSI_CTL1_CTCDIV;
            TSI_CTL1 = ctl1;
        } else {
            /* config TSI_CTL0 */
            ctl0 = TSI_CTL0;
            prescaler &= ~0x08U;
            /*configure TSI clock division factor,charge state duration time,charge transfer state duration time */
            ctl0 &= ~(TSI_CTL0_CTCDIV | TSI_CTL0_CDT | TSI_CTL0_CTDT);
            ctl0 |= (((prescaler << 12U) & TSI_CTL0_CTCDIV) | (charge_duration & TSI_CTL0_CDT) | (transfer_duration & TSI_CTL0_CTDT));
            TSI_CTL0 = ctl0;

            /* config TSI_CTL1 */
            ctl1 = TSI_CTL1;
            ctl1 |= TSI_CTL1_CTCDIV;
            TSI_CTL1 = ctl1;
        }
    }
}

/*!
    \brief      configure the max cycle number of a charge-transfer sequence (API_ID(0x0010U))
    \param[in]  max_number: max cycle number
                only one parameter can be selected which is shown as below:
      \arg        TSI_MAXNUM255:   the max cycle number of a sequence is 255
      \arg        TSI_MAXNUM511:   the max cycle number of a sequence is 511
      \arg        TSI_MAXNUM1023:  the max cycle number of a sequence is 1023
      \arg        TSI_MAXNUM2047:  the max cycle number of a sequence is 2047
      \arg        TSI_MAXNUM4095:  the max cycle number of a sequence is 4095
      \arg        TSI_MAXNUM8191:  the max cycle number of a sequence is 8191
      \arg        TSI_MAXNUM16383: the max cycle number of a sequence is 16383
    \param[out] none
    \retval     none
*/
void tsi_max_number_config(uint32_t max_number)
{
    if(RESET == (TSI_CTL0 & TSI_CTL0_TSIS)) {
        uint32_t maxnum;
        maxnum = TSI_CTL0;
        /*configure the max cycle number of a charge-transfer sequence*/
        maxnum &= ~TSI_CTL0_MCN;
        maxnum |= (max_number & TSI_CTL0_MCN);
        TSI_CTL0 = maxnum;
    }
}

/*!
    \brief      switch on hysteresis pin (API_ID(0x0011U))
    \param[in]  group_pin: select pin which will be switched on hysteresis
                one or more parameters can be selected which are shown as below:
      \arg        TSI_PHM_GxPy(x=0..2,y=0..3): pin y of group x switch on hysteresis
    \param[out] none
    \retval     none
*/
void tsi_hysteresis_on(uint32_t group_pin)
{
    TSI_PHM |= (group_pin & TSI_PIN_MASK);
}

/*!
    \brief      switch off hysteresis pin (API_ID(0x0012U))
    \param[in]  group_pin: select pin which will be switched off hysteresis
                one or more parameters can be selected which are shown as below:
      \arg        TSI_PHM_GxPy(x=0..2,y=0..3): pin y of group x switch off hysteresis
    \param[out] none
    \retval     none
*/
void tsi_hysteresis_off(uint32_t group_pin)
{
    TSI_PHM &= ~(group_pin & TSI_PIN_MASK);
}

/*!
    \brief      switch on analog pin (API_ID(0x0013U))
    \param[in]  group_pin: select pin which will be switched on analog
                one or more parameters can be selected which are shown as below:
      \arg        TSI_ASW_GxPy(x=0..2,y=0..3):pin y of group x switch on analog
    \param[out] none
    \retval     none
*/
void tsi_analog_on(uint32_t group_pin)
{
    TSI_ASW |= (group_pin & TSI_PIN_MASK);
}

/*!
    \brief      switch off analog pin (API_ID(0x0014U))
    \param[in]  group_pin: select pin which will be switched off analog
                one or more parameters can be selected which are shown as below:
      \arg        TSI_ASW_GxPy(x=0..2,y=0..3):pin y of group x switch off analog
    \param[out] none
    \retval     none
*/
void tsi_analog_off(uint32_t group_pin)
{
    TSI_ASW &= ~(group_pin & TSI_PIN_MASK);
}

/*!
    \brief      enable group (API_ID(0x0015U))
    \param[in]  group: select group to be enabled
                one or more parameters can be selected which are shown as below:
      \arg        TSI_GCTL_GEx(x=0..2): the x group will be enabled
    \param[out] none
    \retval     none
*/
void tsi_group_enable(uint32_t group)
{
    TSI_GCTL |= (group & TSI_GROUP_MASK);
}

/*!
    \brief      disable group (API_ID(0x0016U))
    \param[in]  group: select group to be disabled
                one or more parameters can be selected which are shown as below:
      \arg        TSI_GCTL_GEx(x=0..2):the x group will be disabled
    \param[out] none
    \retval     none
*/
void tsi_group_disable(uint32_t group)
{
    TSI_GCTL &= ~(group & TSI_GROUP_MASK);
}

/*!
    \brief      get group complete status (API_ID(0x0017U))
    \param[in]  group: select group
                only one parameter can be selected which is shown as below:
      \arg        TSI_GCTL_GCx(x=0..2): get the complete status of group x
    \param[out] none
    \retval     FlagStatus: group complete status,SET or RESET
*/
FlagStatus tsi_group_status_get(uint32_t group)
{
    FlagStatus flag_status;

    if(TSI_GCTL & group) {
        flag_status = SET;
    } else {
        flag_status = RESET;
    }
    return flag_status;
}

/*!
    \brief      get the cycle number for group0 as soon as a charge-transfer sequence completes (API_ID(0x0018U))
    \param[in]  none
    \param[out] none
    \retval     group0 cycle number
*/
uint16_t tsi_group0_cycle_get(void)
{
    return (uint16_t)TSI_G0CYCN;
}

/*!
    \brief      get the cycle number for group1 as soon as a charge-transfer sequence completes (API_ID(0x0019U))
    \param[in]  none
    \param[out] none
    \retval     group1 cycle number
*/
uint16_t tsi_group1_cycle_get(void)
{
    return (uint16_t)TSI_G1CYCN;
}

/*!
    \brief      get the cycle number for group2 as soon as a charge-transfer sequence completes (API_ID(0x001AU))
    \param[in]  none
    \param[out] none
    \retval     group2 cycle number
*/
uint16_t tsi_group2_cycle_get(void)
{
    return (uint16_t)TSI_G2CYCN;
}

/*!
    \brief      get TSI flag (API_ID(0x001BU))
    \param[in]  flag:
                only one parameter can be selected which is shown as below:
      \arg        TSI_FLAG_CTCF: charge-transfer complete flag
      \arg        TSI_FLAG_MNERR: max Cycle Number Error
    \param[out] none
    \retval     FlagStatus:SET or RESET
*/
FlagStatus tsi_flag_get(uint32_t flag)
{
    FlagStatus flag_status;

    if(TSI_INTF & flag) {
        flag_status = SET;
    } else {
        flag_status = RESET;
    }
    return flag_status;
}

/*!
    \brief      clear TSI flag (API_ID(0x001CU))
    \param[in]  flag: select flag which will be cleared
                only one parameter can be selected which is shown as below:
      \arg        TSI_FLAG_CTCF: clear charge-transfer complete flag
      \arg        TSI_FLAG_MNERR: clear max cycle number error
    \param[out] none
    \retval     none
*/
void tsi_flag_clear(uint32_t flag)
{
    TSI_INTC |= (flag & TSI_FLAG_INT_MASK);
}

/*!
    \brief      enable TSI interrupt (API_ID(0x001DU))
    \param[in]  source: select interrupt which will be enabled
                only one parameter can be selected which is shown as below:
      \arg        TSI_INT_CCTCF: charge-transfer complete flag interrupt enable
      \arg        TSI_INT_MNERR:  max cycle number error interrupt enable
    \param[out] none
    \retval     none
*/
void tsi_interrupt_enable(uint32_t source)
{
    TSI_INTEN |= (source & TSI_FLAG_INT_MASK);
}

/*!
    \brief      disable TSI interrupt (API_ID(0x001EU))
    \param[in]  source: select interrupt which will be disabled
                only one parameter can be selected which is shown as below:
      \arg        TSI_INT_CCTCF: charge-transfer complete flag interrupt disable
      \arg        TSI_INT_MNERR: max cycle number error interrupt disable
    \param[out] none
    \retval     none
*/
void tsi_interrupt_disable(uint32_t source)
{
    TSI_INTEN &= ~(source & TSI_FLAG_INT_MASK);
}

/*!
    \brief      get TSI interrupt flag (API_ID(0x001FU))
    \param[in]  flag:
                only one parameter can be selected which is shown as below:
      \arg        TSI_INT_FLAG_CTCF: charge-transfer complete flag
      \arg        TSI_INT_FLAG_MNERR: max Cycle Number Error
    \param[out] none
    \retval     FlagStatus:SET or RESET
*/
FlagStatus tsi_interrupt_flag_get(uint32_t flag)
{
    uint32_t interrupt_enable = 0U, interrupt_flag = 0U;
    FlagStatus flag_status;

    interrupt_flag = (TSI_INTF & flag);
    interrupt_enable = (TSI_INTEN & flag);

    if(interrupt_flag && interrupt_enable) {
        flag_status = SET;
    } else {
        flag_status = RESET;
    }

    return flag_status;
}

/*!
    \brief      clear TSI interrupt flag (API_ID(0x0020U))
    \param[in]  flag: select flag which will be cleared
                only one parameter can be selected which is shown as below:
      \arg        TSI_INT_FLAG_CTCF: clear charge-transfer complete flag
      \arg        TSI_INT_FLAG_MNERR: clear max cycle number error
    \param[out] none
    \retval     none
*/
void tsi_interrupt_flag_clear(uint32_t flag)
{
    TSI_INTC |= (flag & TSI_FLAG_INT_MASK);
}

#endif /* defined (GD32W515) */
